[Killed] ObjectLiteral
src/verify.ts:89:41
  * @rules SEC-1, DoD-3
  * @adr ADR-0001
  */
-export const PrincipalSchema = z.object({
-  sub: PrincipalId,
-  iss: IssuerId,
-  kid: KidId,
-  scope: z.array(Scope).min(1),
-  jti: JtiId,
-  iat: z.number().int().positive(),
-});
+export const PrincipalSchema = z.object({});
 export type PrincipalSchemaType = z.infer<typeof PrincipalSchema>;
 
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: expected undefined to be 'operator-001' // Object.is equality

[Killed] MethodExpression
src/verify.ts:93:10
   sub: PrincipalId,
   iss: IssuerId,
   kid: KidId,
-  scope: z.array(Scope).min(1),
+  scope: z.array(Scope).max(1),
   jti: JtiId,
   iat: z.number().int().positive(),
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: invalid principal claims: [
  {
    "code": "too_big",
    "maximum": 1,
    "type": "array",
    "inclusive": true,
    "exact": false,
    "message": "Array must contain at most 1 element(s)",

[Killed] StringLiteral
src/verify.ts:135:21
 const DEFAULT_CLOCK_SKEW_SECONDS = 30;
 
 /** Only EdDSA (Ed25519) is accepted. Rejects none, HS256, RS256, etc. */
-const ALLOWED_ALG = 'EdDSA';
+const ALLOWED_ALG = "";
 
 // ─────────────────────────────────────────────────────────────────────────
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: rejected algorithm 'EdDSA' — only EdDSA is accepted

[Killed] LogicalOperator
src/verify.ts:159:21
  * @adr ADR-0001
  */
 export function createVerifyJwt(config: VerifyJwtConfig): (token: string) => Promise<ResolvedPrincipal> {
-  const clockSkew = config.clockSkewSeconds ?? DEFAULT_CLOCK_SKEW_SECONDS;
+  const clockSkew = config.clockSkewSeconds && DEFAULT_CLOCK_SKEW_SECONDS;
 
   return async function verifyJwt(token: string): Promise<ResolvedPrincipal> {
killedBy: verifyJwt — SEC-1 JWT verification default clockSkew (30s) accepts token expired by 5s
statusReason: JWT has expired

[Killed] BlockStatement
src/verify.ts:164:9
   return async function verifyJwt(token: string): Promise<ResolvedPrincipal> {
     // ── Step 1: Decode header to extract kid + alg ──
     let header: { kid?: string; alg?: string };
-    try {
-      header = decodeProtectedHeader(token);
-    } catch {
+    try {} catch {
       throw new AuthError('malformed JWT header', 'auth.malformed');
     }
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: Cannot read properties of undefined (reading 'kid')

[Killed] BlockStatement
src/verify.ts:166:13
     let header: { kid?: string; alg?: string };
     try {
       header = decodeProtectedHeader(token);
-    } catch {
-      throw new AuthError('malformed JWT header', 'auth.malformed');
-    }
+    } catch {}
 
     // ── Step 2: Reject missing/empty kid (M6 mutant target) ──
killedBy: verifyJwt — SEC-1 JWT verification malformed JWT header throws auth.malformed
statusReason: Cannot read properties of undefined (reading 'kid')

[Killed] ConditionalExpression
src/verify.ts:172:9
 
     // ── Step 2: Reject missing/empty kid (M6 mutant target) ──
     const kid = header.kid;
-    if (!kid) {
+    if (true) {
       config.eventLogger.missingKid();
       throw new AuthError('missing key identifier (kid) in JWT header', 'auth.missing_kid');
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: missing key identifier (kid) in JWT header

[Killed] BooleanLiteral
src/verify.ts:172:9
 
     // ── Step 2: Reject missing/empty kid (M6 mutant target) ──
     const kid = header.kid;
-    if (!kid) {
+    if (kid) {
       config.eventLogger.missingKid();
       throw new AuthError('missing key identifier (kid) in JWT header', 'auth.missing_kid');
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: missing key identifier (kid) in JWT header

[Killed] StringLiteral
src/verify.ts:174:73
     const kid = header.kid;
     if (!kid) {
       config.eventLogger.missingKid();
-      throw new AuthError('missing key identifier (kid) in JWT header', 'auth.missing_kid');
+      throw new AuthError('missing key identifier (kid) in JWT header', "");
     }
 
killedBy: verifyJwt — SEC-1 JWT verification missing kid throws auth.missing_kid + logs missingKid
statusReason: expected '' to be 'auth.missing_kid' // Object.is equality

[Killed] ConditionalExpression
src/verify.ts:180:9
     // ── Step 3: Reject disallowed algorithms (M4 mutant target) ──
     // jose's jwtVerify with algorithms option handles this, but we check
     // explicitly so the error message is precise and the branch is Stryker-visible.
-    if (header.alg !== ALLOWED_ALG) {
+    if (true) {
       config.eventLogger.invalidSignature(kid);
       throw new AuthError(
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: rejected algorithm 'EdDSA' — only EdDSA is accepted

[Killed] EqualityOperator
src/verify.ts:180:9
     // ── Step 3: Reject disallowed algorithms (M4 mutant target) ──
     // jose's jwtVerify with algorithms option handles this, but we check
     // explicitly so the error message is precise and the branch is Stryker-visible.
-    if (header.alg !== ALLOWED_ALG) {
+    if (header.alg === ALLOWED_ALG) {
       config.eventLogger.invalidSignature(kid);
       throw new AuthError(
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: rejected algorithm 'EdDSA' — only EdDSA is accepted

[Killed] LogicalOperator
src/verify.ts:183:32
     if (header.alg !== ALLOWED_ALG) {
       config.eventLogger.invalidSignature(kid);
       throw new AuthError(
-        `rejected algorithm '${header.alg ?? 'missing'}' — only EdDSA is accepted`,
+        `rejected algorithm '${header.alg && 'missing'}' — only EdDSA is accepted`,
         'auth.invalid_signature',
       );
killedBy: verifyJwt — SEC-1 JWT verification missing alg header throws auth.invalid_signature with "missing" in message
statusReason: expected 'rejected algorithm \'undefined\' — on…' to contain 'missing'

[Killed] StringLiteral
src/verify.ts:183:9
     if (header.alg !== ALLOWED_ALG) {
       config.eventLogger.invalidSignature(kid);
       throw new AuthError(
-        `rejected algorithm '${header.alg ?? 'missing'}' — only EdDSA is accepted`,
+        ``,
         'auth.invalid_signature',
       );
killedBy: verifyJwt — SEC-1 JWT verification missing alg header throws auth.invalid_signature with "missing" in message
statusReason: expected '' to contain 'missing'

[Killed] BlockStatement
src/verify.ts:190:33
 
     // ── Step 4: Resolve public key by kid (key rotation support) ──
     const keyEntry = config.keyRegistry.get(kid);
-    if (keyEntry === undefined) {
-      config.eventLogger.invalidSignature(kid);
-      throw new AuthError(`unknown key identifier: ${kid}`, 'auth.unknown_kid');
-    }
+    if (keyEntry === undefined) {}
 
     // ── Step 5: Verify signature via jose (M5 mutant target) ──
killedBy: verifyJwt — SEC-1 JWT verification unknown kid throws auth.unknown_kid + logs invalidSignature
statusReason: expected 'auth.invalid_signature' to be 'auth.unknown_kid' // Object.is equality

[Killed] ConditionalExpression
src/verify.ts:190:9
 
     // ── Step 4: Resolve public key by kid (key rotation support) ──
     const keyEntry = config.keyRegistry.get(kid);
-    if (keyEntry === undefined) {
+    if (false) {
       config.eventLogger.invalidSignature(kid);
       throw new AuthError(`unknown key identifier: ${kid}`, 'auth.unknown_kid');
killedBy: verifyJwt — SEC-1 JWT verification unknown kid throws auth.unknown_kid + logs invalidSignature
statusReason: expected 'auth.invalid_signature' to be 'auth.unknown_kid' // Object.is equality

[Killed] BlockStatement
src/verify.ts:197:9
 
     // ── Step 5: Verify signature via jose (M5 mutant target) ──
     let payload: ReturnType<typeof decodeJwt>;
-    try {
-      const { payload: verifiedPayload } = await jwtVerify(token, keyEntry.publicKey, {
-        algorithms: [ALLOWED_ALG],
-        clockTolerance: clockSkew,
-      });
-      payload = verifiedPayload;
-    } catch (err: unknown) {
+    try {} catch (err: unknown) {
       // Distinguish expired from invalid signature.
       // For expired tokens, decode the payload (unverified) to extract
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: Cannot read properties of undefined (reading 'iat')

[Killed] ObjectLiteral
src/verify.ts:198:87
     // ── Step 5: Verify signature via jose (M5 mutant target) ──
     let payload: ReturnType<typeof decodeJwt>;
     try {
-      const { payload: verifiedPayload } = await jwtVerify(token, keyEntry.publicKey, {
-        algorithms: [ALLOWED_ALG],
-        clockTolerance: clockSkew,
-      });
+      const { payload: verifiedPayload } = await jwtVerify(token, keyEntry.publicKey, {});
       payload = verifiedPayload;
     } catch (err: unknown) {
killedBy: verifyJwt — SEC-1 JWT verification default clockSkew (30s) accepts token expired by 5s
statusReason: JWT has expired

[Killed] ArrayDeclaration
src/verify.ts:199:21
     let payload: ReturnType<typeof decodeJwt>;
     try {
       const { payload: verifiedPayload } = await jwtVerify(token, keyEntry.publicKey, {
-        algorithms: [ALLOWED_ALG],
+        algorithms: [],
         clockTolerance: clockSkew,
       });
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: JWT signature verification failed

[Killed] BlockStatement
src/verify.ts:203:28
         clockTolerance: clockSkew,
       });
       payload = verifiedPayload;
-    } catch (err: unknown) {
-      // Distinguish expired from invalid signature.
-      // For expired tokens, decode the payload (unverified) to extract
-      // principal info for the event log — this is safe because we're
-      // only logging, not trusting the claims.
-      if (err instanceof Error && err.name === 'JWTExpired') {
-        const decoded = decodeJwt(token);
-        config.eventLogger.expired(extractPrincipalInfo(decoded, kid));
-        throw new AuthError('JWT has expired', 'auth.expired');
-      }
-      config.eventLogger.invalidSignature(kid);
-      throw new AuthError('JWT signature verification failed', 'auth.invalid_signature');
-    }
+    } catch (err: unknown) {}
 
     // ── Step 6: Enforce maximum lifetime (exp - iat <= 3600s) ──
killedBy: verifyJwt — SEC-1 JWT verification expired JWT throws auth.expired + logs expired event
statusReason: Cannot read properties of undefined (reading 'iat')

[Killed] ConditionalExpression
src/verify.ts:208:11
       // For expired tokens, decode the payload (unverified) to extract
       // principal info for the event log — this is safe because we're
       // only logging, not trusting the claims.
-      if (err instanceof Error && err.name === 'JWTExpired') {
+      if (true) {
         const decoded = decodeJwt(token);
         config.eventLogger.expired(extractPrincipalInfo(decoded, kid));
killedBy: verifyJwt — SEC-1 JWT verification signature mismatch throws auth.invalid_signature + logs
statusReason: expected 'auth.expired' to be 'auth.invalid_signature' // Object.is equality

[Killed] ConditionalExpression
src/verify.ts:208:11
       // For expired tokens, decode the payload (unverified) to extract
       // principal info for the event log — this is safe because we're
       // only logging, not trusting the claims.
-      if (err instanceof Error && err.name === 'JWTExpired') {
+      if (false) {
         const decoded = decodeJwt(token);
         config.eventLogger.expired(extractPrincipalInfo(decoded, kid));
killedBy: verifyJwt — SEC-1 JWT verification expired JWT throws auth.expired + logs expired event
statusReason: expected 'auth.invalid_signature' to be 'auth.expired' // Object.is equality

[Killed] StringLiteral
src/verify.ts:211:48
       if (err instanceof Error && err.name === 'JWTExpired') {
         const decoded = decodeJwt(token);
         config.eventLogger.expired(extractPrincipalInfo(decoded, kid));
-        throw new AuthError('JWT has expired', 'auth.expired');
+        throw new AuthError('JWT has expired', "");
       }
       config.eventLogger.invalidSignature(kid);
killedBy: verifyJwt — SEC-1 JWT verification expired JWT throws auth.expired + logs expired event
statusReason: expected '' to be 'auth.expired' // Object.is equality

[Killed] StringLiteral
src/verify.ts:214:64
         throw new AuthError('JWT has expired', 'auth.expired');
       }
       config.eventLogger.invalidSignature(kid);
-      throw new AuthError('JWT signature verification failed', 'auth.invalid_signature');
+      throw new AuthError('JWT signature verification failed', "");
     }
 
killedBy: verifyJwt — SEC-1 JWT verification signature mismatch throws auth.invalid_signature + logs
statusReason: expected '' to be 'auth.invalid_signature' // Object.is equality

[Killed] StringLiteral
src/verify.ts:214:27
         throw new AuthError('JWT has expired', 'auth.expired');
       }
       config.eventLogger.invalidSignature(kid);
-      throw new AuthError('JWT signature verification failed', 'auth.invalid_signature');
+      throw new AuthError("", 'auth.invalid_signature');
     }
 
killedBy: verifyJwt — SEC-1 JWT verification signature failure error message contains "signature"
statusReason: expected '' to contain 'signature'

[Killed] ConditionalExpression
src/verify.ts:221:9
     // jose verifies exp > now, but does NOT enforce the 1h ceiling or require iat.
     const iat = payload.iat;
     const exp = payload.exp;
-    if (iat === undefined || exp === undefined) {
+    if (false) {
       throw new AuthError('JWT missing iat or exp claim', 'auth.malformed');
     }
killedBy: verifyJwt — SEC-1 JWT verification missing exp throws auth.malformed
statusReason: expected promise to reject

[Killed] ConditionalExpression
src/verify.ts:221:9
     // jose verifies exp > now, but does NOT enforce the 1h ceiling or require iat.
     const iat = payload.iat;
     const exp = payload.exp;
-    if (iat === undefined || exp === undefined) {
+    if (false || exp === undefined) {
       throw new AuthError('JWT missing iat or exp claim', 'auth.malformed');
     }
killedBy: verifyJwt — SEC-1 JWT verification missing iat error message contains "missing"
statusReason: expected 'invalid principal claims: [\n  {\n   …' to contain 'missing'

[Killed] ConditionalExpression
src/verify.ts:224:9
     if (iat === undefined || exp === undefined) {
       throw new AuthError('JWT missing iat or exp claim', 'auth.malformed');
     }
-    if (exp - iat > MAX_TOKEN_LIFETIME_SECONDS) {
+    if (false) {
       const info = extractPrincipalInfo(payload, kid);
       config.eventLogger.expired(info);
killedBy: verifyJwt — SEC-1 JWT verification lifetime exceeds 1h ceiling throws auth.expired
statusReason: expected promise to reject

[Killed] BlockStatement
src/verify.ts:224:49
     if (iat === undefined || exp === undefined) {
       throw new AuthError('JWT missing iat or exp claim', 'auth.malformed');
     }
-    if (exp - iat > MAX_TOKEN_LIFETIME_SECONDS) {
-      const info = extractPrincipalInfo(payload, kid);
-      config.eventLogger.expired(info);
-      throw new AuthError('JWT lifetime exceeds 1h maximum', 'auth.expired');
-    }
+    if (exp - iat > MAX_TOKEN_LIFETIME_SECONDS) {}
 
     // ── Step 7: Validate principal schema (no defaults — Winston #20) ──
killedBy: verifyJwt — SEC-1 JWT verification lifetime exceeds 1h ceiling throws auth.expired
statusReason: expected promise to reject

[Killed] StringLiteral
src/verify.ts:227:27
     if (exp - iat > MAX_TOKEN_LIFETIME_SECONDS) {
       const info = extractPrincipalInfo(payload, kid);
       config.eventLogger.expired(info);
-      throw new AuthError('JWT lifetime exceeds 1h maximum', 'auth.expired');
+      throw new AuthError("", 'auth.expired');
     }
 
killedBy: verifyJwt — SEC-1 JWT verification lifetime exceeds 1h ceiling throws auth.expired
statusReason: expected '' to contain 'exceeds'

[Killed] ConditionalExpression
src/verify.ts:235:9
       ...payload,
       kid,
     });
-    if (!parseResult.success) {
+    if (true) {
       throw new AuthError(`invalid principal claims: ${parseResult.error.message}`, 'auth.malformed');
     }
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] BooleanLiteral
src/verify.ts:235:9
       ...payload,
       kid,
     });
-    if (!parseResult.success) {
+    if (parseResult.success) {
       throw new AuthError(`invalid principal claims: ${parseResult.error.message}`, 'auth.malformed');
     }
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: Cannot read properties of undefined (reading 'message')

[Killed] StringLiteral
src/verify.ts:236:27
       kid,
     });
     if (!parseResult.success) {
-      throw new AuthError(`invalid principal claims: ${parseResult.error.message}`, 'auth.malformed');
+      throw new AuthError(``, 'auth.malformed');
     }
     const validated = parseResult.data;
killedBy: verifyJwt — SEC-1 JWT verification schema parse failure (empty scope) throws auth.malformed
statusReason: expected '' to contain 'invalid principal claims'

[Killed] BlockStatement
src/verify.ts:242:53
 
     // ── Step 8: Check revocation list ──
     const jtiStr = validated.jti as string;
-    if (config.revocationChecker.isRevoked(jtiStr)) {
-      const info = toPrincipalInfo(validated);
-      config.eventLogger.revoked(info, 'administratively revoked');
-      throw new AuthError(`JWT revoked: jti ${jtiStr}`, 'auth.revoked');
-    }
+    if (config.revocationChecker.isRevoked(jtiStr)) {}
 
     // ── Step 9: Replay detection (atomic check-and-record) ──
killedBy: verifyJwt — SEC-1 JWT verification revoked jti throws auth.revoked + logs revoked with full info
statusReason: expected promise to reject

[Killed] ConditionalExpression
src/verify.ts:242:9
 
     // ── Step 8: Check revocation list ──
     const jtiStr = validated.jti as string;
-    if (config.revocationChecker.isRevoked(jtiStr)) {
+    if (true) {
       const info = toPrincipalInfo(validated);
       config.eventLogger.revoked(info, 'administratively revoked');
killedBy: verifyJwt — SEC-1 JWT verification valid JWT resolves to principal with all fields
statusReason: JWT revoked: jti 71683f44-5931-4546-98d6-da6425b2248f

[Killed] StringLiteral
src/verify.ts:244:40
     const jtiStr = validated.jti as string;
     if (config.revocationChecker.isRevoked(jtiStr)) {
       const info = toPrincipalInfo(validated);
-      config.eventLogger.revoked(info, 'administratively revoked');
+      config.eventLogger.revoked(info, "");
       throw new AuthError(`JWT revoked: jti ${jtiStr}`, 'auth.revoked');
     }
killedBy: verifyJwt — SEC-1 JWT verification revoked jti throws auth.revoked + logs revoked with full info
statusReason: expected '' to be 'administratively revoked' // Object.is equality

[Killed] BlockStatement
src/verify.ts:250:68
 
     // ── Step 9: Replay detection (atomic check-and-record) ──
     // M2/M7 mutant targets: removing or inverting this check must be killed.
-    if (!config.replayDetector.checkAndRecord(validated.jti, exp)) {
-      const info = toPrincipalInfo(validated);
-      config.eventLogger.replay(info);
-      throw new AuthError(`JWT replay detected: jti ${jtiStr} already used`, 'auth.replay');
-    }
+    if (!config.replayDetector.checkAndRecord(validated.jti, exp)) {}
 
     // ── Step 10: Return resolved principal ──
killedBy: verifyJwt — SEC-1 JWT verification replayed jti throws auth.replay + logs replay
statusReason: expected promise to reject

[Killed] ConditionalExpression
src/verify.ts:250:9
 
     // ── Step 9: Replay detection (atomic check-and-record) ──
     // M2/M7 mutant targets: removing or inverting this check must be killed.
-    if (!config.replayDetector.checkAndRecord(validated.jti, exp)) {
+    if (false) {
       const info = toPrincipalInfo(validated);
       config.eventLogger.replay(info);
killedBy: verifyJwt — SEC-1 JWT verification replayed jti throws auth.replay + logs replay
statusReason: expected promise to reject

[Killed] StringLiteral
src/verify.ts:253:78
     if (!config.replayDetector.checkAndRecord(validated.jti, exp)) {
       const info = toPrincipalInfo(validated);
       config.eventLogger.replay(info);
-      throw new AuthError(`JWT replay detected: jti ${jtiStr} already used`, 'auth.replay');
+      throw new AuthError(`JWT replay detected: jti ${jtiStr} already used`, "");
     }
 
killedBy: verifyJwt — SEC-1 JWT verification replayed jti throws auth.replay + logs replay
statusReason: expected '' to be 'auth.replay' // Object.is equality

[Killed] StringLiteral
src/verify.ts:253:27
     if (!config.replayDetector.checkAndRecord(validated.jti, exp)) {
       const info = toPrincipalInfo(validated);
       config.eventLogger.replay(info);
-      throw new AuthError(`JWT replay detected: jti ${jtiStr} already used`, 'auth.replay');
+      throw new AuthError(``, 'auth.replay');
     }
 
killedBy: verifyJwt — SEC-1 JWT verification replay error message contains jti
statusReason: expected '' to contain 'replay-test-jti'

[Killed] BlockStatement
src/verify.ts:278:98
  *
  * @rules SEC-1
  */
-export function requireScope(principal: ResolvedPrincipal, required: readonly ScopeType[]): void {
-  const hasAll = required.every((r) => principal.scope.includes(r));
-  if (!hasAll) {
-    throw new AuthError(
-      `insufficient scope: required [${required.join(', ')}], got [${[...principal.scope].join(', ')}]`,
-      'auth.insufficient_scope',
-    );
-  }
-}
+export function requireScope(principal: ResolvedPrincipal, required: readonly ScopeType[]): void {}
 
 // ─────────────────────────────────────────────────────────────────────────
killedBy: verifyJwt — SEC-1 JWT verification insufficient scope throws auth.insufficient_scope
statusReason: expected function to throw an error, but it didn't

[Killed] ArrowFunction
src/verify.ts:279:33
  * @rules SEC-1
  */
 export function requireScope(principal: ResolvedPrincipal, required: readonly ScopeType[]): void {
-  const hasAll = required.every((r) => principal.scope.includes(r));
+  const hasAll = required.every(() => undefined);
   if (!hasAll) {
     throw new AuthError(
killedBy: verifyJwt — SEC-1 JWT verification requireScope passes when all required scopes present
statusReason: expected [Function] to not throw an error but 'AuthError: insufficient scope: requir…' was thrown

[Killed] MethodExpression
src/verify.ts:279:18
  * @rules SEC-1
  */
 export function requireScope(principal: ResolvedPrincipal, required: readonly ScopeType[]): void {
-  const hasAll = required.every((r) => principal.scope.includes(r));
+  const hasAll = required.some(r => principal.scope.includes(r));
   if (!hasAll) {
     throw new AuthError(
killedBy: verifyJwt — SEC-1 JWT verification requireScope: every→some mutant killed (partial scope fails)
statusReason: expected function to throw an error, but it didn't

[Killed] ConditionalExpression
src/verify.ts:280:7
  */
 export function requireScope(principal: ResolvedPrincipal, required: readonly ScopeType[]): void {
   const hasAll = required.every((r) => principal.scope.includes(r));
-  if (!hasAll) {
+  if (true) {
     throw new AuthError(
       `insufficient scope: required [${required.join(', ')}], got [${[...principal.scope].join(', ')}]`,
killedBy: verifyJwt — SEC-1 JWT verification requireScope passes when all required scopes present
statusReason: expected [Function] to not throw an error but 'AuthError: insufficient scope: requir…' was thrown

[Killed] BooleanLiteral
src/verify.ts:280:7
  */
 export function requireScope(principal: ResolvedPrincipal, required: readonly ScopeType[]): void {
   const hasAll = required.every((r) => principal.scope.includes(r));
-  if (!hasAll) {
+  if (hasAll) {
     throw new AuthError(
       `insufficient scope: required [${required.join(', ')}], got [${[...principal.scope].join(', ')}]`,
killedBy: verifyJwt — SEC-1 JWT verification insufficient scope throws auth.insufficient_scope
statusReason: expected function to throw an error, but it didn't

[Killed] ArrayDeclaration
src/verify.ts:282:70
   const hasAll = required.every((r) => principal.scope.includes(r));
   if (!hasAll) {
     throw new AuthError(
-      `insufficient scope: required [${required.join(', ')}], got [${[...principal.scope].join(', ')}]`,
+      `insufficient scope: required [${required.join(', ')}], got [${[].join(', ')}]`,
       'auth.insufficient_scope',
     );
killedBy: verifyJwt — SEC-1 JWT verification insufficient scope throws auth.insufficient_scope
statusReason: expected 'insufficient scope: required [admin],…' to contain 'read'

[Killed] StringLiteral
src/verify.ts:282:96
   const hasAll = required.every((r) => principal.scope.includes(r));
   if (!hasAll) {
     throw new AuthError(
-      `insufficient scope: required [${required.join(', ')}], got [${[...principal.scope].join(', ')}]`,
+      `insufficient scope: required [${required.join(', ')}], got [${[...principal.scope].join("")}]`,
       'auth.insufficient_scope',
     );
killedBy: verifyJwt — SEC-1 JWT verification requireScope: principal with multiple scopes shows comma in got-clause
statusReason: expected 'insufficient scope: required [admin],…' to contain 'read, write'

[Killed] BlockStatement
src/verify.ts:292:65
 // Helpers
 // ─────────────────────────────────────────────────────────────────────────
 
-function toPrincipalInfo(p: PrincipalSchemaType): PrincipalInfo {
-  return {
-    sub: p.sub as string,
-    iss: p.iss as string,
-    kid: p.kid as string,
-    jti: p.jti as string,
-    scope: p.scope,
-  };
-}
+function toPrincipalInfo(p: PrincipalSchemaType): PrincipalInfo {}
 
 function extractPrincipalInfo(payload: ReturnType<typeof decodeJwt>, kid: string): PrincipalInfo {
killedBy: verifyJwt — SEC-1 JWT verification replayed jti throws auth.replay + logs replay
statusReason: Cannot read properties of undefined (reading 'sub')

[Killed] ObjectLiteral
src/verify.ts:293:10
 // ─────────────────────────────────────────────────────────────────────────
 
 function toPrincipalInfo(p: PrincipalSchemaType): PrincipalInfo {
-  return {
-    sub: p.sub as string,
-    iss: p.iss as string,
-    kid: p.kid as string,
-    jti: p.jti as string,
-    scope: p.scope,
-  };
+  return {};
 }
 
killedBy: verifyJwt — SEC-1 JWT verification replayed jti throws auth.replay + logs replay
statusReason: expected undefined to be 'replay-sub' // Object.is equality

[Killed] BlockStatement
src/verify.ts:302:98
   };
 }
 
-function extractPrincipalInfo(payload: ReturnType<typeof decodeJwt>, kid: string): PrincipalInfo {
-  return {
-    sub: (payload.sub as string | undefined) ?? '<unknown>',
-    iss: (payload.iss as string | undefined) ?? '<unknown>',
-    kid,
-    jti: (payload.jti as string | undefined) ?? '<unknown>',
-    scope: Array.isArray(payload['scope']) ? (payload['scope'] as ScopeType[]) : [],
-  };
-}
+function extractPrincipalInfo(payload: ReturnType<typeof decodeJwt>, kid: string): PrincipalInfo {}
 
killedBy: verifyJwt — SEC-1 JWT verification expired token logs expired with principal info from decoded payload
statusReason: Cannot read properties of undefined (reading 'sub')

[Killed] LogicalOperator
src/verify.ts:304:10
 
 function extractPrincipalInfo(payload: ReturnType<typeof decodeJwt>, kid: string): PrincipalInfo {
   return {
-    sub: (payload.sub as string | undefined) ?? '<unknown>',
+    sub: payload.sub as string | undefined && '<unknown>',
     iss: (payload.iss as string | undefined) ?? '<unknown>',
     kid,
killedBy: verifyJwt — SEC-1 JWT verification expired token logs expired with principal info from decoded payload
statusReason: expected '<unknown>' to be 'operator-xyz' // Object.is equality

[Killed] LogicalOperator
src/verify.ts:305:10
 function extractPrincipalInfo(payload: ReturnType<typeof decodeJwt>, kid: string): PrincipalInfo {
   return {
     sub: (payload.sub as string | undefined) ?? '<unknown>',
-    iss: (payload.iss as string | undefined) ?? '<unknown>',
+    iss: payload.iss as string | undefined && '<unknown>',
     kid,
     jti: (payload.jti as string | undefined) ?? '<unknown>',
killedBy: verifyJwt — SEC-1 JWT verification expired token logs expired with principal info from decoded payload
statusReason: expected '<unknown>' to be 'iip-issuer' // Object.is equality

[Killed] StringLiteral
src/verify.ts:305:49
 function extractPrincipalInfo(payload: ReturnType<typeof decodeJwt>, kid: string): PrincipalInfo {
   return {
     sub: (payload.sub as string | undefined) ?? '<unknown>',
-    iss: (payload.iss as string | undefined) ?? '<unknown>',
+    iss: (payload.iss as string | undefined) ?? "",
     kid,
     jti: (payload.jti as string | undefined) ?? '<unknown>',
killedBy: verifyJwt — SEC-1 JWT verification expired token with no claims logs unknown defaults
statusReason: expected '' to be '<unknown>' // Object.is equality
