[Killed] LogicalOperator
src/verify.ts:307:10
     sub: (payload.sub as string | undefined) ?? '<unknown>',
     iss: (payload.iss as string | undefined) ?? '<unknown>',
     kid,
-    jti: (payload.jti as string | undefined) ?? '<unknown>',
+    jti: payload.jti as string | undefined && '<unknown>',
     scope: Array.isArray(payload['scope']) ? (payload['scope'] as ScopeType[]) : [],
   };
killedBy: verifyJwt — SEC-1 JWT verification expired token with no claims logs unknown defaults
statusReason: expected undefined to be '<unknown>' // Object.is equality

[Killed] StringLiteral
src/verify.ts:308:34
     iss: (payload.iss as string | undefined) ?? '<unknown>',
     kid,
     jti: (payload.jti as string | undefined) ?? '<unknown>',
-    scope: Array.isArray(payload['scope']) ? (payload['scope'] as ScopeType[]) : [],
+    scope: Array.isArray(payload[""]) ? (payload['scope'] as ScopeType[]) : [],
   };
 }
killedBy: verifyJwt — SEC-1 JWT verification expired token logs expired with principal info from decoded payload
statusReason: expected [] to deeply equal [ 'read', 'admin' ]
